In [ ]:
import pandas as pd
import numpy as np

In [6]:
import pandas as pd
import numpy as np
data = pd.Series([1,2,3,4,5],index = ["a","b","c","d","e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
data.name = "Numbers"

In [8]:
data.size

5

In [9]:
data

a    1
b    2
c    3
d    4
e    5
Name: Numbers, dtype: int64

In [10]:
data.shape

(5,)

In [11]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [16]:
data["a"]

1

In [20]:
data.loc[["a","c","e"]],data.iloc[3]

(a    1
 c    3
 e    5
 Name: Numbers, dtype: int64,
 4)

In [22]:
dictionary={
    "USN":[1,2,3,4],
    "name":["Keerthana","Nameera","Habibha","Neha"],
    "age":[23,21,23,22],
    "branch":["MCA","MCA","MCA","MCA"]
}

In [23]:
df = pd.DataFrame(dictionary)
df

   USN       name  age branch
0    1  Keerthana   23    MCA
1    2    Nameera   21    MCA
2    3    Habibha   23    MCA
3    4       Neha   22    MCA

In [24]:
data = pd.read_csv(r"C:\Users\keert\Downloads\sample.csv")

In [29]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        20 non-null     int64
 1   EmpID             20 non-null     int64
 2   Name              20 non-null     object
 3   Department        20 non-null     object
 4   Age               20 non-null     int64
 5   Salary            20 non-null     int64
 6   Experience        20 non-null     int64
 7   JoiningDate       20 non-null     object
 8   City              20 non-null     object
 9   PerformanceScore  20 non-null     float64
dtypes: float64(1), int64(5), object(4)
memory usage: 1.7+ KB

In [31]:
data.shape

(20, 10)

In [32]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [33]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

In [35]:
data[["Name","Salary","Department"]]

     Name  Salary Department
0     Ram   50000         IT
1   Shyam   45000         HR
2   Geeta   60000    Finance
3   Anita   75000         IT
4   Kiran   52000         HR
5    John   58000    Finance
6   Meena   82000         IT
7   David   48000         HR
8    Sara   61000    Finance
9   Arjun   54000         IT
10   Ravi   47000         HR
11  Priya   59000    Finance
12  Kunal   90000         IT
13  Sneha   51000         HR
14  Vijay   62000    Finance
15   Neha   88000         IT
16   Amit   53000         HR
17  Pooja   57000    Finance
18  Rahul   56000         IT
19  Divya   49500         HR

In [36]:
type(data.Name)

pandas.core.series.Series

In [37]:
data[["Name","Salary","Department"]].head(2)

    Name  Salary Department
0    Ram   50000         IT
1  Shyam   45000         HR

In [38]:
type(data.Name)

pandas.core.series.Series

In [43]:
data1 = pd.read_csv(r"C:\Users\keert\Downloads\test2.csv")
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [45]:
data1.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [48]:
data1.loc["0" : "1" , "Name":"Department"]

    Name   Age Department
0  Alice  25.0         HR
1    Bob  30.0         IT

In [49]:
data1.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [51]:
data1.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [52]:
data1.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [53]:
data1=data1

In [54]:
data1.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)

In [55]:
data1

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [57]:
data1

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [60]:
data1.drop('Unnamed: 0',axis=1,inplace=True)

In [61]:
data1

         N     A        D        S
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [66]:
data1["updated_salary"]=data1["S"]+5000

In [67]:
data1

         N     A        D        S  updated_salary
0    Alice  25.0       HR  50000.0         55000.0
1      Bob  30.0       IT  60000.0         65000.0
2  Charlie  35.0  Finance  70000.0         75000.0
3    David   NaN       IT  62000.0         67000.0
4      Eve  29.0       HR      NaN             NaN
5    Alice  25.0       HR  50000.0         55000.0

In [68]:
data1["updated_salary2"]=data1["S"].map(lambda x:x+10000)
data1

         N     A        D        S  updated_salary  updated_salary2
0    Alice  25.0       HR  50000.0         55000.0          60000.0
1      Bob  30.0       IT  60000.0         65000.0          70000.0
2  Charlie  35.0  Finance  70000.0         75000.0          80000.0
3    David   NaN       IT  62000.0         67000.0          72000.0
4      Eve  29.0       HR      NaN             NaN              NaN
5    Alice  25.0       HR  50000.0         55000.0          60000.0

In [69]:
data1.dropna(inplace=True)
data1.isnull().sum()

N                  0
A                  0
D                  0
S                  0
updated_salary     0
updated_salary2    0
dtype: int64

In [76]:
data1["A"]=data1.A.astype("int")

In [77]:
data1

         N   A        D        S  updated_salary  updated_salary2
0    Alice  25       HR  50000.0         55000.0          60000.0
1      Bob  30       IT  60000.0         65000.0          70000.0
2  Charlie  35  Finance  70000.0         75000.0          80000.0
5    Alice  25       HR  50000.0         55000.0          60000.0

In [78]:
data1[data1["A"]>25]

         N   A        D        S  updated_salary  updated_salary2
1      Bob  30       IT  60000.0         65000.0          70000.0
2  Charlie  35  Finance  70000.0         75000.0          80000.0